# Find passengers on board for each bus.

* Source 1: https://stackoverflow.com/questions/69475572/sql-join-query-two-tables
* Source 2: https://stackoverflow.com/questions/68885664/sql-to-find-all-passengers-boarding-a-bus

For each bus, return the number of passengers boarding it. Just two columns: the bus id and passengers on board.

In [1]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
5 rows affected.
5 rows affected.
 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

In [3]:
%%sql

SELECT * FROM buses;

 * postgresql://fknight:***@localhost/postgres
5 rows affected.

[(10, 'Warsaw', 'Berlin', datetime.time(10, 55)),
 (20, 'Berlin', 'Paris', datetime.time(6, 20)),
 (21, 'Berlin', 'Paris', datetime.time(14, 0)),
 (22, 'Berlin', 'Paris', datetime.time(21, 40)),
 (30, 'Paris', 'Madrid', datetime.time(13, 30))]

In [9]:
%%sql

SELECT * FROM passengers;

 * postgresql://fknight:***@localhost/postgres
9 rows affected.

[(1, 'Paris', 'Madrid', datetime.time(13, 30)),
 (2, 'Paris', 'Madrid', datetime.time(13, 31)),
 (10, 'Warsaw', 'Paris', datetime.time(10, 0)),
 (11, 'Warsaw', 'Berlin', datetime.time(22, 31)),
 (40, 'Berlin', 'Paris', datetime.time(6, 15)),
 (41, 'Berlin', 'Paris', datetime.time(6, 50)),
 (42, 'Berlin', 'Paris', datetime.time(7, 12)),
 (43, 'Berlin', 'Paris', datetime.time(12, 3)),
 (44, 'Berlin', 'Paris', datetime.time(20, 0))]

# Part A

Create a subquery to get the time range for each bus.

## The expected solution is below

|id|origin|destination|time|prev_time|
|--- |--- |--- |--- |--- |
|20|Berlin|Paris|06:20:00|None|
|21|Berlin|Paris|14:00:00|06:20:00|
|22|Berlin|Paris|21:40:00|14:00:00|
|30|Paris|Madrid|13:30:00|None|
|10|Warsaw|Berlin|10:55:00|None|

# Type your SQL below

In [8]:
# %%sql
#
# Type your query here